app/controllers/rewriter_controller.rb

DELETE FROM `prefixes` WHERE (user_id = 1)
DELETE FROM `instances` WHERE (user_id = 1)
---
  def index
    #Pbuilder::Adapter.purge(session[:user_id])
    Prefix.delete_all(["user_id = ?", session[:user_id]])
    Instance.delete_all(["user_id = ?", session[:user_id]])

SELECT * FROM `onto_sources` WHERE (user_id='1') LIMIT 1
SELECT `prefixes`.id FROM `prefixes` WHERE (`prefixes`.`prefix` = BINARY 'dc') LIMIT 1
---
  def load
    files = Dir["#{AERIA_DIRECTORY}/*"].collect { |path| path_to_url(path) }
    @url_str = "Files loaded from " + path_to_url(AERIA_DIRECTORY)
    explorer = Pbuilder::CloudsExplorer.new(files,
                                            PERSISTENT_AERIA,
                                            session[:user_id],
                                            { :report => true,
                                              :patterns_file  =>  PATTERNS_FILE,
                                              :analysis_file  =>  ANALYSIS_FILE,
                                              :mappings_file  =>  MAPPINGS_FILE } )
    @global_rc_list = explorer.global_root_concepts
    @global_finders = explorer.global_finders
    @abstract_concepts = explorer.mappings.keys.sort
    @prefixes = explorer.prefixes
    onto_source = OntoSource.find(:first, :conditions => "user_id='#{session[:user_id]}'")
    if onto_source.source == "local"
    # Adapter already builded in uploading step
      adapter = Pbuilder::Adapter.get_connection( PERSISTENT_ONTO,
                                                  session[:user_id],
                                                  "", PERSISTENCE_DIR)
      begin
        @prefixes = Pbuilder::Adapter.get_prefixes(onto_adapter)
      rescue Exception => e
        puts e.message
        puts e.backtrace.inspect
      ensure
        adapter.close
      end
    else
      @prefixes = explorer.prefixes
      @prefixes.each do |prefix, namespace|

SELECT * FROM `onto_sources` WHERE (user_id='1') LIMIT 1
SELECT * FROM `ontologies` WHERE (user_id='1') LIMIT 1
INSERT INTO `instances` (`uri`, `concept`, `pattern`, `level`, `user_id`, `created_at`, `updated_at`) VALUES(0, NULL, 1, 0, 1, '2011-06-29 09:16:43', '2011-06-29 09:16:43')
---
  def rewrite

    reader = Pbuilder::YamlReader.new(session[:user_id],
                                      MAPPINGS_FILE,
                                      PATTERNS_FILE,
                                      ANALYSIS_FILE)
    a_concept = params[:settings][:a_concept]
    constraint = params[:settings][:constraint]
    patterns, analysis = reader.load(a_concept)
    core_concept_node = patterns[a_concept].root
    @patterns = core_concept_node.build_patterns
    @analysis = analysis[a_concept]
    @max_size = max_size
    onto_source = OntoSource.find(:first, :conditions => "user_id='#{session[:user_id]}'")
    if onto_source.source == "endpoint"
      onto = Ontology.find(:first, :conditions => "user_id='#{session[:user_id]}'")
      adapter = Pbuilder::EndpointAdapter.add_source(onto.url)
      Prefix.get_prefixes(session[:user_id])
    else
      adapter = Pbuilder::Adapter.get_connection( PERSISTENT_ONTO,
                                                  session[:user_id])
    end
    @core_instances = []
    begin
      @core_concept_rsc = RDFS::Resource.new(core_concept_node.value)
      query = Query.new.extend(Pbuilder::Query)
      query = query.search_by_concept(@core_concept_rsc, constraint)
      query.execute do |instance|
        @core_instances << instance

SELECT * FROM `onto_sources` WHERE (user_id='1') LIMIT 1
SELECT `prefixes`.id FROM `prefixes` WHERE (`prefixes`.`prefix` = BINARY 'dbpedia' AND `prefixes`.id <> 112) LIMIT 1
UPDATE `prefixes` SET `prefix` = 'dbp_owl', `updated_at` = '2011-06-10 15:54:12' WHERE `id` = 61
---
  def edit_prefix
    @e_namespace = params[:namespace]
    @e_value = params[:value]
    @e_editorId = params[:editorId]
    @e_old_prefix = params[:old_prefix]

    onto_source = OntoSource.find(:first, :conditions => "user_id='#{session[:user_id]}'")
    if onto_source.source == "local"
      adapter = Pbuilder::Adapter.get_connection( PERSISTENT_ONTO,
                                                session[:user_id].to_s)
      if @e_old_prefix == UNDEFINED_PREFIX
        Pbuilder::Adapter.remove_prefix(adapter, "")
      else
        Pbuilder::Adapter.remove_prefix(adapter, @e_old_prefix)
      end
      Pbuilder::Adapter.set_prefix(adapter, @e_value, @e_namespace)

      adapter.close
    else
      if @e_old_prefix == UNDEFINED_PREFIX
        p = Prefix.find(:first,
                        :conditions => ["prefix = ? and user_id = ?", "", session[:user_id]])
      else
        p = Prefix.find(:first,
                        :conditions => ["prefix = ? and user_id = ?", @e_old_prefix, session[:user_id]])
      end
      p.prefix = @e_value
      if ! p.save