app/controllers/uploader_controller.rb

SELECT * FROM `ontologies` WHERE (user_id='1') LIMIT 1
SELECT * FROM `onto_sources` WHERE (user_id='1') LIMIT 1
---
  def upload_onto
    @ontology = Ontology.find(:first, :conditions => "user_id='#{session[:user_id]}'")
    @onto_source = OntoSource.find(:first, :conditions => "user_id='#{session[:user_id]}'")

SELECT * FROM `onto_sources` WHERE (user_id='1') LIMIT 1
UPDATE `onto_sources` SET `source` = 'local', `updated_at` = '2011-06-07 16:18:30' WHERE `id` = 1
---
  def save_onto
    begin
      post = UploadedOnto.save(params[:upload])
    rescue
      flash[:notice_bad] = "Something went wrong"
    else
      flash[:notice_ok] = "File has been uploaded successfully"
      build_adapter_from_directory( UploadedOnto::DIRECTORY,
                                    PERSISTENCE_DIR,
                                    PERSISTENT_ONTO )
      @onto_source = OntoSource.find(:first, :conditions => "user_id='#{session[:user_id]}'")
      if ! @onto_source
        @onto_source = OntoSource.new()
        @onto_source.user_id = session[:user_id]
      end
      @onto_source.source = "local"
      @onto_source.save

SELECT * FROM `ontologies` WHERE (user_id='1') LIMIT 1
INSERT INTO `ontologies` (`url`, `user_id`, `created_at`, `updated_at`) VALUES('--- !map:HashWithIndifferentAccess \nontolology: http://dbpedia.org/ontology/\n', 1, '2011-04-22 16:31:16', '2011-04-22 16:31:16')
UPDATE `ontologies` SET `url` = 'http://dbpedia.org/ontology/#', `user_id` = 1, `updated_at` = '2011-04-22 16:53:35' WHERE `id` = 2
SELECT * FROM `onto_sources` WHERE (user_id='1') LIMIT 1
UPDATE `onto_sources` SET `source` = 'endpoint', `updated_at` = '2011-05-04 09:42:04' WHERE `id` = 1
---
  def save_url
    @ontology = Ontology.find(:first, :conditions => "user_id='#{session[:user_id]}'")
    if ! @ontology
      @ontology = Ontology.new
    end
    @ontology.url = params[:ontology][:url]
    @ontology.user_id = session[:user_id]
    if @ontology.save
      flash[:notice_ok] = "Dataset defined correctly"
      @onto_source = OntoSource.find(:first, :conditions => "user_id='#{session[:user_id]}'")
      if ! @onto_source
        @onto_source = OntoSource.new()
        @onto_source.user_id = session[:user_id]
      end
      @onto_source.source = "endpoint"
      @onto_source.save

SELECT * FROM `onto_sources` WHERE (user_id='1') LIMIT 1
INSERT INTO `onto_sources` (`source`, `user_id`, `created_at`, `updated_at`) VALUES(NULL, 1, '2011-05-04 09:12:58', '2011-05-04 09:12:58')
UPDATE `onto_sources` SET `source` = 'endpoint', `updated_at` = '2011-05-04 09:19:10' WHERE `id` = 1
---
  def select_source
    @onto_source = OntoSource.find(:first, :conditions => "user_id='#{session[:user_id]}'")
    if ! @onto_source
      @onto_source = OntoSource.new()
      @onto_source.user_id = session[:user_id]
    end
    @onto_source.source = params[:onto_source][:source]
    if @onto_source.save