app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `hashed_password`, `salt`, `created_at`, `updated_at`) VALUES('tuland', 'e1631c9dcabd23ddc592579ef5a2d8d6651959ea', '39020.59222996724272', '2010-11-29 10:49:08', '2010-11-29 10:49:08')
---
  def create
    @user = User.new(params[:user])
    respond_to do |format|
    if @user.save